Tekla Open API Reference for Tekla Structures 2025
ClosedGraphicObjectAttributes Properties
The ClosedGraphicObject.ClosedGraphicObjectAttributes type exposes the following members.
Properties
Name | Description
BehindModelObjects
 Gets or sets whether the closed graphic object is drawn behind model objects
Hatch
 The hatch attributes of the closed graphic object (the closed graphic object is hatchable).
Line
 The line attributes of the graphic object. A graphic object always consists of lines.
 (Inherited from GraphicObject.GraphicObjectAttributes.)
Top
See Also
Reference
ClosedGraphicObject.ClosedGraphicObjectAttributes Class
Tekla.Structures.Drawing Namespace